app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."state" = $2  [["user_id", 2], ["state", "Backlog"]]
---
	def index
		@backlog_tasks = current_user.tasks.where(state: 'Backlog')

INSERT INTO "tasks" ("title", "description", "state", "deadline", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@task = current_user.tasks.build(task_params)
		if @task.save

UPDATE "tasks" SET "state" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["state", "Done"], ["updated_at", "2024-06-19 13:21:05.309347"], ["id", 2]]
---
	def update
		if @task.update(task_params)